<template>
  <div class="container w-full md:max-w-4xl mx-auto pt-4 blog">
    <router-link to="/" class="s-underline text-2xl font-bold">
      &lt; 返回到首页
    </router-link>
    <h1 class="mt-2 text-4xl md:text-5xl font-extrabold">常见问题</h1>
    <div class="divider mt-0" />
    <h2># 为什么我无法注册？</h2>
    <p>为防止可能出现的脚本哥，本站自当前版本起加强了注册时校验，您需要在人机检测之后方可提交注册申请。如果您在注册时提示无法注册或提示注册存在风险，请您尝试刷新网站或更换浏览器重新注册。</p>
    <h2># 为什么我无法托管？</h2>
    <p>请检查您提交的游戏账号密码是否正确。如果您是首次使用可露希尔云平台，在添加完游戏账号之后，您将收到短信验证码。在通过验证码核实身份前，您的托管账号不会进行日常操作。</p>
    <h2># 为什么我无法战斗？</h2>
    <p>为提高模拟器集群工作效率，减少无意义点击，每个游戏账号战斗的分配调度先由平台根据游戏关卡开放数据进行控制。由于团队均为在校生 / 普通社畜，导致活动更新开放时平台无法及时更新游戏数据，拒绝了战斗任务的分配调度。如您急于完成活动关卡的战斗，平台建议您在本地使用其他自动化点击工具完成。</p>
    <h2># 为什么我战斗失败？</h2>
    <p>平台目前完全无偿提供服务，受实际用户数量影响，平台为每个游戏客户端分配的算力资源有限，无法与您的个人设备性能相提并论。如果您的战斗失败，99%为您的代理在<b>本站服务器</b>上存在漏怪的情况。唯一的解决办法是重新通关保存一个新的代理，避免极限下干员、撤退、少人、堵门等<b>自用速通</b>打法。你站无修改作弊加速游戏能力，出现漏怪的情况我们也无能为力。如您强调在自用设备上不存在漏怪的情况，请参照上一条回答尝试注销本站账号，使用本地工具完成日常战斗。</p>
  </div>
</template>
<script setup lang="ts">
</script>