<template>
  <div class="container w-full md:max-w-4xl mx-auto pt-4 blog">
    <router-link to="/" class="s-underline text-2xl font-bold">
      &lt; 返回到首页
    </router-link>
    <h1 class="mt-2 text-4xl md:text-5xl font-extrabold">用户条款及隐私政策</h1>
    <h3>生效日期：2023年8月1日</h3>
    <h3>一修日期：2023年11月25日</h3>
    <div class="divider mt-0" />
    <p>您使用「可露希尔云平台」托管服务，即表示您信赖我们对您的信息的处理方式。我们深知这项责任事关重大，因此一直致力于保护您的信息，并让您拥有控制权。</p>
    <p>本平台基于自研手机模拟器集群管理及图像识别系统为您提供《明日方舟》游戏日常托管服务，平台所涉及的公司名称、商标、产品等均为其各自所有者的资产，仅供识别。平台内可能使用的游戏图片、动画、音频、文本原文，仅用于更好地表现游戏资料，其版权属于 Arknights / 上海鹰角网络科技有限公司。<b>如果我们的内容或服务侵犯了您的权利，或违反了相关的法律法规，请通过 admin#arknights.app"#"换成"@"）与我们取得联系。</b></p>
    <p>自您注册或登录「可露希尔云平台」，即视为您已充分阅读、理解并接受更新后的本条款并愿意受更新后的本条款的约束，最终解释权归开发运维团队所有。</p>
    <h2># 我们收集了什么</h2>
    <ul class="list-disc list-inside">
      <li>在请求平台接口时，我们会收集您的 IP 信息避免算力资源被滥用</li>
      <li>在您注册平台通行证时，我们会要求您填写手机号码，并进行所属权验证</li>
      <li>在您提交游戏账号托管时，我们会收集您的游戏账号密码</li>
      <li>在您配置游戏托管设定时，我们会收集您的配置信息</li>
      <li>在完成托管操作时，识别产生的各类游戏信息会被存储</li>
    </ul>
    <p>特别的，本平台所使用的内容分发网络（CDN）技术提供商可能会收集更多的个人身份标识信息，此类信息的收集、使用或披露并不在我们的控制范围内。我们建议您查阅相关提供商的隐私政策，以了解更多关于他们如何处理您的个人信息的细节。作为平台必要服务使用，我们默认您接受相关平台进行的数据收集。</p>
    <h2># 如何保障安全性</h2>
    <p>本平台拥有强大的安全功能，可以为您的信息持续提供保护。我们会在维护「可露希尔云平台」期间获得信息资料，这些信息资料有助于我们检测并自动阻止安全威胁。如检测到我们认为您应知晓的风险，将会通知您并引导您完成一些步骤，以便您的隐私数据受到更好的保护。</p>
    <p>我们会努力为您和「可露希尔云平台」提供保护，以防其他人在未经授权的情况下访问、篡改、披露或破坏我们拥有的信息。为此我们采取了很多措施，其中包括：</p>
    <ul class="list-disc list-inside">
      <li>关键数据加密存储</li>
      <li>提供详细可溯源的操作日志</li>
      <li>上线前各接口进行安全审计，避免系统注入、未授权等安全隐患</li>
      <li>有且仅有平台开发运维团队可访问您的数据，操作前将会被记录并提前通知</li>
    </ul>
    <h2># 导出或注销信息</h2>
    <p>如您不再使用本平台提供的托管服务，您可以自行删除已经添加的游戏账号，如您还需进一步注销平台账号，请通过平台首页的工单系统与我们取得联系</p>
    <p>我们可为您提供托管服务期间产生的日志数据，其他收集信息恕无法提供。如您需要可供查阅的日志数据，烦请通过平台首页的工单系统提交申请。</p>
    <h2># 防范欺诈与滥用</h2>
    <p>「可露希尔云平台」已持续提供公益托管服务2年有余，目前用户群体数量日益增加。为提高平台服务质量，避免公共资源滥用，自本版本起，平台将严格限制<b>用户账号下可配置的游戏账号数量</b>。具体反滥用措施如下：</p>
    <div role="alert" class="rounded-sm border-s-4 border-info bg-info/10 px-4 py-2">
      <p>您需要通过<b>网页版</b>注册本平台通行证，且通过人机检测&风控检测后平台才会处理您的注册申请。您在成功注册后默认将拥有<b>1个游戏托管额度</b>，此时您可以添加<b>能接收验证码</b>的游戏账号（B服请使用手机号登录）以<b>体验</b>本平台托管服务<b>24小时</b>。</p>
      <p>在您体验的这24小时内，平台会在您的游戏账号首次成功启动时向该手机号发送短信验证码，您需要及时在时间段内完成<b>账号归属认证</b>。如超期不提交认证，您的游戏账号及平台账号将被<b>永久冻结、无法使用平台服务</b>。因此在使用本平台前请慎重选择第一个提交托管的账号，检查是否可以正常接受验证码。</p>
      <p>完成手机号短信认证后，您将自动升级托管额度到<b>2</b>。请注意，您的首个托管账号无法修改用户名，将作为您的通行证属性绑定。</p>
      <p>此外，在完成短信认证后，您还可通过<b>绑定QQ</b>将托管额度进一步升级到<b>3</b>。具体的绑定方式请见官方QQ群。</p>
    </div>
    <p class="text-base-content/60">* 有关更多托管额度的细节内容，请登录平台后在个人主页进行查看。</p>
    <p>如果您注册平台账号之后未实际添加游戏托管，您的账号将不定期被系统删除。</p>
    <p>如发现您存在注册多个平台账号、多个游戏账号在多个平台账号下交替出现等滥用行为，我们将不提前通知，直接封禁您的一切账号。所添加的一切游戏账号均会被<b>冻结暂停、加入平台黑名单</b>。</p>
    <p>如果您发现有滥用平台资源、利用本平台服务私自商业化行为的情况或线索，欢迎通过一切可与我们取得联系的方式进行反馈，我们将会第一时间验证核实并进行封禁处理。</p>
    <h2># 免责声明</h2>
    <p>本平台基于图像识别提供公益托管服务，<b>随时可能</b>由于包括但不限于机房停电、自然灾害、人为战争、版权方要求、运维人力等因素导致平台暂停或终止运营。平台不作任何可用性保证，因平台故障、更新、停服、算力不足等造成的托管计划外损失，平台不承担任何责任。</p>
    <p>平台目前托管用户数量较多，若因针对平台打击的<b>集体游戏账号封号</b>，本平台不承担任何责任。<b>在您选择本平台使用托管服务时，我们默认 / 已经通知到可能存在的因违反游戏用户条款导致的封号风险，您需要自行承担相关风险。</b></p>
    <p>本平台承诺未使用任何修改游戏内存、模拟器变速战斗等违反游戏用户条款的行为，承诺不存在计划外的使用用户游戏账号资源。若出现用户游戏账号毁号等情况，本站仅可协助提供完整的日志操作记录，不承担相关责任。</p>
    <p>若您在不知情的情况下，被他人添加至本平台托管服务，您可以通过平台首页的工单系统与我们取得联系，我们将会在核实后删除您的游戏账号。</p>
  </div>
</template>

<script setup lang="ts">
</script>